using DropWord.TgBot.Core.Field;
using DropWord.TgBot.Core.Field.Controller;
using Telegram.Bot;
using Telegram.Bot.Types;

namespace DropWord.TgBot.Core.Manager.Info.Implementation;

public class InfoManager : IInfoManager
{
    private readonly ITelegramBotClient _client;

    public InfoManager(ITelegramBotClient client)
    {
        _client = client;
    }
    public string HelpText => $"""
                            Ласкаво просимо! 👋
                            Наш додаток зроблено так, щоб вчити мову стало цікавіше і простіше.
                            
                            🔘 Чат 💬 - спілкуйтеся мовою яку вивчаєте, закріплюйте знання і вчіться висловлювати думки самостійно. Більш детально /{CommandField.HelpChat}

                            🔘 Повтор речень 🎴 - щодня переглядайте речення і запам'ятовуйте слова в живому контексті. Це допомагає не просто вчити слова, а розуміти їхній зміст у мові. Більш детально /{CommandField.HelpRepeatSentences}

                            🔘 Налаштування ⚙️ - налаштуйте додаток так, щоб він став вашим ідеальним помічником. Більш детально /{CommandField.HelpSettings}
                            """;

    public string HelpRepeatSentencesText => $"""   
                                             Процес повторення схожий на використання карток: ви бачите слово з одного боку і його переклад з іншого, послідовно запам'ятовуючи їх.
                                             Кожне речення, додане через кнопку *"{BaseField.NewSentenceButton}"*, потрапляє в чергу повторення.
                                             При натисканні на кнопку *"{BaseField.RepeatSentenceKeyboard}"* буде показано одне з раніше доданих речень, з одним прихованим перекладом, щоб ви могли пригадати його значення.
                                             
                                             ⚪️ Щоб додати нове речення, треба написати в чат перебуваючи в головному меню. Бот автоматично перекладе та збереже його для вас.
                                             
                                             *{BaseField.NewSentenceButton}* => Всі речення, які ви додали, не будуть пропонуватися вам в повторі, оскільки їх немає ще в черзі. Ця кнопка буде додавати по одному реченню в чергу.
                                             
                                             *{BaseField.RepeatSentenceKeyboard}* => Кнопка повтору, після кожного натискання, вам відобразитися речення і його переклад в прихованому вигляді, ваше завдання перевести його, і після натиснути на ||приховане||, щоб переконатися, що ви його правельно перевели.
                                             
                                             *{BaseField.SentencesRepetitionByInputKeyboard}* => Кнопка повтору введенням, це режим, в якому вам потрібно ввести переклад речення, щоб визначити чи правильно ви його переклали.
                                             """;

    public string HelpNewSentencesText => "";

    public string HelpChatText => $"""
                                  Спілкування - найкращий спосіб закріпити мову на практиці! Тут ви зможете знайти співрозмовника, обговорювати цікаві теми й активно використовувати все, що вивчили. Це допоможе вам не просто запам'ятовувати матеріал, а почуватися впевнено в реальних ситуаціях.

                                  ⚪️ Щоб почати, натисніть *{BaseField.ChatKeyboard}* у головному меню.

                                  🔘 Натисніть *{SmallTalkChatField.SearchNewUserKeyboard}*, щоб знайти партнера для спілкування. Після цього надішліть привітальне повідомлення і почніть бесіду. Спілкуватися можна тільки англійською.

                                  🔘 Під час діалогу ви можете натиснути *{SmallTalkChatField.AnalyzeMessagesKeyboard}* і отримати зворотний зв'язок щодо останніх 6 повідомлень: бот вкаже на помилки, особливості граматики та допоможе поліпшити ваш текст.

                                  ❌ *Обмеження*: можна надіслати до 20 повідомлень на день і зробити до 3 запитів на аналіз.
                                  """;

    public string HelpSettingsText => $"""
                                      ⚪️ Щоб відкрити натисніть кнопку *{BaseField.SettingsKeyboard}*
                                      
                                      *Мова відображення* 🇺🇦 => Дозволяє вибрати, яка мова має бути ||прихованою|| під час повторення.
                                      
                                      *Кількість повторень* 🔃⏰ => Дозволяє вибрати, скільки разів на день вам надсилати повідомлення повтору.
                                      
                                      *Часовий пояс* 🌐⏰ => Дозволяє встановити часовий пояс, у якому ви перебуваєте. Це необхідно для визначення часу надсилання повідомлень повтору
                                      """;

    public async Task SendBotCommandToUserAsync()
    {
        List<BotCommand> commands = new List<BotCommand>()
        {
            new BotCommand(){Command = CommandField.Reload, Description = "Перезавантажити бот"},
            new BotCommand(){Command = CommandField.Help, Description = "Керівництво керування ботом"}
        };
        await _client.SetMyCommandsAsync(commands);
    }
}
